Tutorials/kOmegaStab/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
30320
(
(0.266206 3.23537e-05 0)
(0.266077 9.70336e-05 0)
(0.265819 0.000161631 0)
(0.265431 0.000226091 0)
(0.264915 0.000290359 0)
(0.264271 0.000354381 0)
(0.263498 0.000418103 0)
(0.262599 0.000481471 0)
...
)
;

boundaryField
{
    inlet_half0
    {
        type            cyclic;
    }
    bottom
    {
        type            slip;
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    frontBack
    {
        type            empty;
    }
    inlet_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
